import mythsHeadImage from "../../assets/images/myths/myths-header.jpg";
import CtulhuImage from "../../assets/images/myths/ktulhu.jpg";
import litfilmsImage from "../../assets/images/myths/litfilms.jpg";
import mythsImage from "../../assets/images/myths/myths.jpg";
import strangePlaceImage from "../../assets/images/myths/strange-places.png";

export const mythsHead = {
    title: "МИФЫ И ЛЕГЕНДЫ",
    subtitle: "Древние ужасы, которые живут в\nколлективном подсознании человечества",
    image: mythsHeadImage,
};

export const Ctulhu = {
    eyebrow: "МИФЫ И ЛЕГЕНДЫ ⯘ УЖАС ИЗ ГЛУБИН ВСЕЛЕННОЙ",
    title: "Мифы Ктулху: Когда древние боги пробуждаются",
    text:
            `Говард Филлипс Лавкрафт создал целую мифологию,
            которая пугает уже практически сто лет.
            Древние существа, спящие в глубинах океана и
            между звёздами, чьё простое существование сводит
            людей с ума. Йог-Сотот, Ньярлатотеп, Азатот -
            имена, от которых кровь стынет. Философия космического
            индифферентизма «мы ничто перед лицом бесконечной вселенной»
            стала фундаментом всего жанра.`,
    image: CtulhuImage,
    imageAlt: "Ктулху, как его описывал Лавкрафт",
};

export const litfilms = [
        {
        title: "Ужасы в литературе и в кино",
        description:
            `Описания пока нет`,
        image: litfilmsImage,
        imageAlt: "Пеннивайз - танцующий клоун"
    },
    {
        title: "Мифы мира",
        description:
            `Японская мифология породила одних из
            самых пугающих существ в мировой культуре:
            замораживающая путников Юки-онна, Кутисакэ-онна
            - женщина с разрезанным ртом, Юрей - духи мёртвых
            возвращающиеся отомстить. Однако, не только Япония
            полна ужасающих существ: мавки и упыри славян, 
            вендиго индейцев, барон Самди в вуду и многие другие существа,
            на протяжение многих веков вселяющие страх в души
            людей.`,
        image: mythsImage,
        imageAlt: "Кутисакэ-онна, приносящая смерть всем, кто говорит о её красоте"
    },
    {
        title: "Проклятые места мира",
        description:
            `Старые замки Трансильвании, заброшенные
            монастыри Ирландии, подземелья Праги - Европа
            хранит тысячи историй о проклятиях и призраках.
            Замок Бран и граф Дракула, Чёрная башня Пражского
            Града, призраки лондонского Тауэра - легенды,
            ставшие частью мировой культуры.`,
        image: strangePlaceImage,
        imageAlt: "Бран - замок Дракулы"
    },
];

export const worldmyths = [
    {
        subgenre: "ИНТЕРНЕТ-ФОЛЬКЛОР",
        title: "Слендермен",
        description: 
            `Порождение фотошопа и коллективного воображения.
            Высокое существо в костюме и без лица, которое похищает
            детей. Слендермен сал первой интернет-крипипастой,
            породившей реальные игры, фильмы и даже трагические события.
            Миф, созданный в 2009 году, показал силу цифрового
            фольколора.`,
    },
        {
        subgenre: "ИГРОВАЯ ЛЕГЕНДА",
        title: "Проклятые игры",
        description: 
            `Polybius, Lavender Town, BEN Drowned - легенды о
            проклятых видеоиграх, вызывающих кошмары, болезни и
            смерть. Эти истории показывают, как хоррор-эстетика
            проникает в поп-культуру, создавая новый вид
            современного фольклора.`,
    },
        {
        subgenre: "DARK WEB",
        title: "Красная комната",
        description: 
            `Мифы о сайтах в даркнете, транслирующих пытки и
            убийства в прямом эфире. Red Room - одна из самых
            известных городских легенд Интернета. Хотя доказательств
            существования таких мест нет, страх перед ними остаётся
            живым.`,
    },
        {
        subgenre: "АНАЛОГОВЫЙ ХОРРОР",
        title: "The Backrooms, Каталог Манделы",
        description: 
            `Новая волна хоррора, рождённая на YouTube. The Backrooms,
            или Закулисье, - это пространство без выхода, без логики, без конца.
            Каталог Манделы (англ. Mandela Catalogue) - ютуб-сериал
            о замене людей паразитическими существами. Эти проекты
            доказали, что хоррор живёт и развивается.`,
    },
]









